<!DOCTYPE html>
<html lang="{{ str_replace('_', '-', app()->getLocale()) }}">
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1">
        <title>Για εμάς</title>
    </head>
    <body class="">
        <h1> Πτυχιακή Εργασία: Πληροφοριακό Σύστημα για τη καταγραφή και ανάλυση ατυχημάτων.</h1>
        <p>
            Αυτή η εφαρμογή φτιάχτηκε στα πλαίσια της παραπάνω πτυχιακής εργασίας.
            Από τον Αλέξανδρο Πυργιωτάκη

            Τα ID είναι ενδικτικά, σε περιβάλλον production τα id των ατυχημάτων θα ήταν σε SHA256 δηλαδή 64 χαρακτήρε (32 bytes).
            Με αυτόν τον τρόπο αποφεύγω την δυνατότητα κάποιου κακόβουλου χρήστη να "μαντέψει" το id κάποιου ατυχήματος και μέσω κάποιας ευπάθειας του συστήματος να μπορεί να επέμβει σε αυτό.
            Οι πιθανότητες να μαντέψει ο χρήστης κάποιο id ειναι ΜΙΑ στι 10^63 (εικοσάκης εκατομμύρια).

        </p>
    </body>
</html>
